

import * as React from 'react';

import Button from '@mui/material/Button';
import { useState, useEffect } from 'react';
import guess from '../Wassit/guess.json';
import words from '../Wassit/words.json';
import Table from '@mui/material/Table';
import TableBody from '@mui/material/TableBody';
import TableCell from '@mui/material/TableCell';
import TableContainer from '@mui/material/TableContainer';
import TableHead from '@mui/material/TableHead';
import TableRow from '@mui/material/TableRow';
import Paper from '@mui/material/Paper';
import TextField from '@mui/material/TextField';
import Autocomplete, { createFilterOptions } from '@mui/material/Autocomplete';
import FormControl from '@mui/material/FormControl'
import InputLabel from '@mui/material/InputLabel'
import Select from '@mui/material/Select'
import MenuItem from '@mui/material/MenuItem'
const bow = [{
  FIELD1: 0,
  Lettre: 'ء',
  Position: 0,
  BOW:
    '(\'فلان\', 208) (\'شيء\', 131) (\'به\', 86) (\'له\', 71) (\'أوى\', 54) (\'أمر\', 50) (\'أخذ\', 48) (\'جعل\', 46) (\'قوم\', 39) (\'صار\', 35) (\'اشتد\', 34) (\'إلي\', 33) (\'بعض\', 33) (\'أرض\', 30) (\'بين\', 29) (\'أب\', 28) (\'مكان\', 28) (\'كل\', 28) (\'غير\', 27) (\'نحو\', 26)'
},
{
  FIELD1: 1,
  Lettre: 'ء',
  Position: 1,
  BOW:
    '(\'فلان\', 126) (\'شيء\', 60) (\'به\', 32) (\'له\', 20) (\'قوم\', 20) (\'نحو\', 20) (\'أمر\', 19) (\'رجل\', 18) (\'بين\', 18) (\'رأى\', 18) (\'غير\', 17) (\'ولد\', 15) (\'عطف\', 15) (\'أصلح\', 14) (\'رأس\', 14) (\'ثأر\', 13) (\'عمل\', 12) (\'أصاب\', 12) (\'صار\', 12) (\'جعل\', 11)'
},
{
  FIELD1: 2,
  Lettre: 'ء',
  Position: 2,
  BOW:
    '(\'فلان\', 202) (\'شيء\', 143) (\'به\', 101) (\'نحو\', 58) (\'أمر\', 56) (\'أوى\', 49) (\'أرض\', 47) (\'رجل\', 44) (\'قوم\', 41) (\'غير\', 39) (\'له\', 35) (\'إلي\', 34) (\'جعل\', 34) (\'طعام\', 32) (\'مكان\', 26) (\'مال\', 26) (\'أصاب\', 26) (\'ضرب\', 25) (\'كذ\', 22) (\'حمل\', 21)'
},
{
  FIELD1: 3,
  Lettre: 'ب',
  Position: 0,
  BOW:
    '(\'شيء\', 258) (\'فلان\', 138) (\'فل\', 124) (\'رجل\', 99) (\'به\', 94) (\'أمر\', 63) (\'أوى\', 62) (\'له\', 58) (\'نحو\', 57) (\'أرض\', 56) (\'غير\', 51) (\'قوم\', 50) (\'ماء\', 49) (\'جعل\', 46) (\'بر\', 44) (\'مكان\', 39) (\'ظهر\', 38) (\'بعض\', 37) (\'صار\', 33) (\'قبل\', 31)'
},
{
  FIELD1: 4,
  Lettre: 'ب',
  Position: 1,
  BOW:
    '(\'فلان\', 381) (\'شيء\', 331) (\'به\', 127) (\'نحو\', 110) (\'أمر\', 94) (\'أرض\', 93) (\'له\', 79) (\'بعض\', 77) (\'أوى\', 72) (\'غير\', 69) (\'قوم\', 65) (\'جعل\', 64) (\'رجل\', 59) (\'صار\', 50) (\'مكان\', 46) (\'ماء\', 45) (\'ثوب\', 44) (\'حب\', 43) (\'جمع\', 41) (\'كثر\', 41)'
},
{
  FIELD1: 5,
  Lettre: 'ب',
  Position: 2,
  BOW:
    '(\'فلان\', 525) (\'شيء\', 405) (\'نحو\', 136) (\'له\', 111) (\'قوم\', 106) (\'جعل\', 104) (\'به\', 100) (\'ضرب\', 98) (\'غير\', 88) (\'صار\', 78) (\'أمر\', 76) (\'رجل\', 76) (\'ماء\', 71) (\'أوى\', 70) (\'أرض\', 60) (\'بعض\', 60) (\'اشتد\', 52) (\'طلب\', 50) (\'إلي\', 47) (\'عمل\', 47)'
},
{
  FIELD1: 6,
  Lettre: 'ت',
  Position: 0,
  BOW:
    '(\'فلان\', 69) (\'شيء\', 53) (\'نحو\', 27) (\'تم\', 19) (\'أمر\', 17) (\'تل\', 17) (\'تمر\', 17) (\'به\', 15) (\'ذهب\', 14) (\'تاع\', 14) (\'جعل\', 13) (\'رجل\', 13) (\'له\', 12) (\'عقل\', 12) (\'قوم\', 11) (\'صار\', 11) (\'أوى\', 11) (\'ماء\', 11) (\'تلد\', 11) (\'تابع\', 11)'
},
{
  FIELD1: 7,
  Lettre: 'ت',
  Position: 1,
  BOW:
    '(\'فلان\', 174) (\'شيء\', 159) (\'رجل\', 47) (\'به\', 46) (\'أوى\', 43) (\'نحو\', 42) (\'غير\', 34) (\'بعض\', 34) (\'قوم\', 32) (\'له\', 32) (\'أمر\', 31) (\'جعل\', 26) (\'قتل\', 22) (\'وتر\', 22) (\'قتر\', 21) (\'اشتد\', 20) (\'كلام\', 20) (\'فتح\', 20) (\'عت\', 19) (\'مكان\', 18)'
},
{
  FIELD1: 8,
  Lettre: 'ت',
  Position: 2,
  BOW:
    '(\'فلان\', 101) (\'شيء\', 98) (\'به\', 34) (\'أمر\', 27) (\'رجل\', 24) (\'كلام\', 24) (\'صوت\', 24) (\'له\', 20) (\'جعل\', 20) (\'غير\', 19) (\'الله\', 18) (\'سحت\', 17) (\'أوى\', 16) (\'أخذ\', 14) (\'نحو\', 14) (\'بيت\', 13) (\'خت\', 13) (\'زيت\', 13) (\'قطع\', 12) (\'قوم\', 12)'
},
{
  FIELD1: 9,
  Lettre: 'ث',
  Position: 0,
  BOW:
    '(\'شيء\', 60) (\'فلان\', 53) (\'ماء\', 28) (\'نحو\', 26) (\'ثقل\', 24) (\'كثر\', 23) (\'أمر\', 22) (\'ثنى\', 21) (\'ثوب\', 19) (\'ثقب\', 19) (\'رجل\', 17) (\'ثمل\', 17) (\'بعض\', 16) (\'صار\', 15) (\'به\', 15) (\'غير\', 14) (\'مال\', 14) (\'ثلج\', 14) (\'مكان\', 13) (\'ثأر\', 13)'
},
{
  FIELD1: 10,
  Lettre: 'ث',
  Position: 1,
  BOW:
    '(\'شيء\', 94) (\'فلان\', 90) (\'به\', 30) (\'رجل\', 27) (\'غير\', 26) (\'أوى\', 26) (\'كثر\', 25) (\'بعض\', 25) (\'أثر\', 23) (\'مثل\', 23) (\'قوم\', 21) (\'نحو\', 21) (\'غلظ\', 20) (\'جعل\', 19) (\'مال\', 19) (\'مكان\', 18) (\'أرض\', 18) (\'ماء\', 18) (\'له\', 16) (\'جمع\', 16)'
},
{
  FIELD1: 11,
  Lettre: 'ث',
  Position: 2,
  BOW:
    '(\'شيء\', 110) (\'فلان\', 93) (\'به\', 47) (\'بعض\', 38) (\'أمر\', 30) (\'بحث\', 26) (\'رجل\', 26) (\'قوم\', 25) (\'غير\', 25) (\'أرض\', 21) (\'نحو\', 21) (\'له\', 18) (\'خلط\', 18) (\'مال\', 17) (\'أوى\', 15) (\'ضرب\', 15) (\'غث\', 14) (\'رث\', 14) (\'مكان\', 13) (\'جعل\', 13)'
},
{
  FIELD1: 12,
  Lettre: 'ج',
  Position: 0,
  BOW:
    '(\'شيء\', 236) (\'فلان\', 224) (\'به\', 85) (\'نحو\', 77) (\'أوى\', 76) (\'قوم\', 71) (\'أرض\', 68) (\'له\', 67) (\'قطع\', 64) (\'رجل\', 59) (\'أمر\', 58) (\'ماء\', 52) (\'مال\', 51) (\'غير\', 47) (\'جمع\', 47) (\'جنب\', 44) (\'جعل\', 43) (\'صار\', 41) (\'كل\', 39) (\'جل\', 39)'
},
{
  FIELD1: 13,
  Lettre: 'ج',
  Position: 1,
  BOW:
    '(\'فلان\', 281) (\'شيء\', 192) (\'به\', 91) (\'رجل\', 68) (\'أوى\', 58) (\'نحو\', 55) (\'أمر\', 54) (\'ماء\', 51) (\'غير\', 47) (\'له\', 43) (\'أرض\', 40) (\'قوم\', 38) (\'إلي\', 37) (\'كلام\', 34) (\'جعل\', 33) (\'بعض\', 33) (\'وجه\', 33) (\'بين\', 26) (\'مال\', 26) (\'صوت\', 25)'
},
{
  FIELD1: 14,
  Lettre: 'ج',
  Position: 2,
  BOW:
    '(\'شيء\', 132) (\'فلان\', 113) (\'أوى\', 48) (\'نحو\', 45) (\'به\', 44) (\'بعض\', 44) (\'بين\', 43) (\'درج\', 43) (\'رجل\', 40) (\'جعل\', 35) (\'أرض\', 35) (\'خرج\', 34) (\'أمر\', 33) (\'قوم\', 31) (\'غير\', 26) (\'شق\', 25) (\'كلام\', 25) (\'مال\', 25) (\'ماء\', 24) (\'ريح\', 24)'
},
{
  FIELD1: 15,
  Lettre: 'ح',
  Position: 0,
  BOW:
    '(\'شيء\', 400) (\'فلان\', 395) (\'به\', 153) (\'نحو\', 123) (\'أمر\', 122) (\'رجل\', 84) (\'جعل\', 79) (\'له\', 71) (\'بعض\', 66) (\'إلي\', 65) (\'أوى\', 61) (\'غير\', 59) (\'قوم\', 59) (\'مكان\', 58) (\'صار\', 56) (\'ماء\', 54) (\'حال\', 53) (\'أرض\', 53) (\'اشتد\', 53) (\'مال\', 50)'
},
{
  FIELD1: 16,
  Lettre: 'ح',
  Position: 1,
  BOW:
    '(\'فلان\', 188) (\'شيء\', 158) (\'به\', 72) (\'إلي\', 53) (\'أرض\', 44) (\'نحو\', 44) (\'رجل\', 43) (\'أمر\', 42) (\'غير\', 41) (\'قشر\', 39) (\'له\', 38) (\'نفس\', 37) (\'لحم\', 35) (\'جعل\', 34) (\'مكان\', 34) (\'أوى\', 34) (\'قوم\', 31) (\'الله\', 28) (\'سحر\', 28) (\'عين\', 26)'
},
{
  FIELD1: 17,
  Lettre: 'ح',
  Position: 2,
  BOW:
    '(\'فلان\', 197) (\'شيء\', 173) (\'نحو\', 85) (\'به\', 80) (\'أوى\', 70) (\'أمر\', 56) (\'ماء\', 55) (\'غير\', 52) (\'له\', 48) (\'رجل\', 37) (\'مال\', 36) (\'جعل\', 36) (\'ضرب\', 35) (\'أرض\', 35) (\'ملح\', 35) (\'قوم\', 31) (\'مسح\', 31) (\'وجه\', 30) (\'ظهر\', 29) (\'مكان\', 29)'
},
{
  FIELD1: 18,
  Lettre: 'خ',
  Position: 0,
  BOW:
    '(\'فلان\', 378) (\'شيء\', 310) (\'به\', 118) (\'غير\', 84) (\'جعل\', 76) (\'نحو\', 75) (\'أوى\', 74) (\'أرض\', 73) (\'قطع\', 61) (\'قوم\', 59) (\'له\', 59) (\'رجل\', 58) (\'مكان\', 52) (\'أخذ\', 52) (\'خلق\', 45) (\'خرج\', 45) (\'خدر\', 43) (\'خلف\', 40) (\'خدع\', 38) (\'كان\', 38)'
},
{
  FIELD1: 19,
  Lettre: 'خ',
  Position: 1,
  BOW:
    '(\'فلان\', 86) (\'شيء\', 61) (\'أخذ\', 45) (\'ماء\', 29) (\'نحو\', 28) (\'أوى\', 26) (\'أمر\', 26) (\'له\', 24) (\'عين\', 24) (\'به\', 24) (\'دخل\', 24) (\'صار\', 21) (\'رجل\', 19) (\'جعل\', 18) (\'دخان\', 18) (\'رخم\', 16) (\'ضرب\', 16) (\'بخر\', 15) (\'شخص\', 15) (\'بعض\', 14)'
},
{
  FIELD1: 20,
  Lettre: 'خ',
  Position: 2,
  BOW:
    '(\'شيء\', 54) (\'فلان\', 48) (\'نحو\', 32) (\'به\', 26) (\'ماء\', 25) (\'رجل\', 22) (\'أوى\', 20) (\'عظم\', 18) (\'تكبر\', 17) (\'سلخ\', 17) (\'أرض\', 16) (\'لحم\', 14) (\'ضرب\', 13) (\'باخ\', 13) (\'سير\', 13) (\'له\', 13) (\'نفخ\', 13) (\'غير\', 12) (\'سكن\', 12) (\'عجين\', 12)'
},
{
  FIELD1: 21,
  Lettre: 'د',
  Position: 0,
  BOW:
    '(\'شيء\', 224) (\'فلان\', 218) (\'به\', 69) (\'قوم\', 57) (\'دفع\', 55) (\'أوى\', 55) (\'نحو\', 52) (\'أرض\', 51) (\'غير\', 51) (\'دخل\', 48) (\'بعض\', 44) (\'أمر\', 43) (\'دار\', 43) (\'دم\', 43) (\'درج\', 42) (\'رجل\', 41) (\'در\', 38) (\'ماء\', 33) (\'دع\', 33) (\'مكان\', 32)'
},
{
  FIELD1: 22,
  Lettre: 'د',
  Position: 1,
  BOW:
    '(\'فلان\', 347) (\'شيء\', 277) (\'به\', 112) (\'أمر\', 78) (\'نحو\', 69) (\'له\', 69) (\'قوم\', 65) (\'غير\', 57) (\'رجل\', 55) (\'إلي\', 54) (\'جعل\', 52) (\'أرض\', 51) (\'بعض\', 50) (\'خدر\', 43) (\'مد\', 41) (\'أوى\', 40) (\'ثوب\', 39) (\'المرأة\', 38) (\'صار\', 37) (\'يد\', 35)'
},
{
  FIELD1: 23,
  Lettre: 'د',
  Position: 2,
  BOW:
    '(\'فلان\', 713) (\'شيء\', 630) (\'به\', 229) (\'نحو\', 203) (\'أمر\', 195) (\'جعل\', 173) (\'غير\', 167) (\'قوم\', 153) (\'له\', 140) (\'رجل\', 132) (\'أوى\', 118) (\'ماء\', 112) (\'بعض\', 103) (\'صار\', 98) (\'أرض\', 94) (\'كثر\', 89) (\'إلي\', 83) (\'الله\', 74) (\'ظهر\', 72) (\'مكان\', 71)'
},
{
  FIELD1: 24,
  Lettre: 'ذ',
  Position: 0,
  BOW:
    '(\'فلان\', 90) (\'شيء\', 66) (\'ذرع\', 34) (\'ذكر\', 33) (\'ذنب\', 27) (\'به\', 25) (\'ذر\', 23) (\'ذهب\', 22) (\'له\', 22) (\'ريح\', 19) (\'غير\', 19) (\'ذلق\', 19) (\'ذم\', 19) (\'ذراع\', 18) (\'نحو\', 17) (\'جعل\', 17) (\'ذال\', 17) (\'ذقن\', 16) (\'ذيل\', 16) (\'ذرب\', 15)'
},
{
  FIELD1: 25,
  Lettre: 'ذ',
  Position: 1,
  BOW:
    '(\'فلان\', 125) (\'شيء\', 107) (\'قطع\', 46) (\'به\', 40) (\'كذب\', 31) (\'أسرع\', 30) (\'رجل\', 25) (\'له\', 24) (\'بعض\', 24) (\'قوم\', 22) (\'أذن\', 21) (\'وذم\', 21) (\'ماء\', 20) (\'خذم\', 20) (\'أوى\', 19) (\'عذر\', 18) (\'غذ\', 17) (\'نحو\', 16) (\'سال\', 16) (\'قذر\', 15)'
},
{
  FIELD1: 26,
  Lettre: 'ذ',
  Position: 2,
  BOW:
    '(\'أخذ\', 43) (\'فلان\', 39) (\'شيء\', 37) (\'قوم\', 19) (\'به\', 16) (\'إلي\', 12) (\'قذ\', 12) (\'نبذ\', 12) (\'أسرع\', 11) (\'قطع\', 10) (\'نفذ\', 10) (\'أمر\', 9) (\'جرذ\', 9) (\'نحو\', 8) (\'أوى\', 8) (\'وجد\', 8) (\'لذيذ\', 8) (\'خلص\', 8) (\'غلب\', 7) (\'عمل\', 7)'
},
{
  FIELD1: 27,
  Lettre: 'ر',
  Position: 0,
  BOW:
    '(\'فلان\', 404) (\'شيء\', 280) (\'أوى\', 122) (\'به\', 117) (\'له\', 115) (\'نحو\', 112) (\'جعل\', 111) (\'بعض\', 91) (\'أمر\', 87) (\'رجل\', 85) (\'غير\', 80) (\'إلي\', 76) (\'قوم\', 74) (\'أرض\', 69) (\'ماء\', 64) (\'صار\', 63) (\'رفع\', 59) (\'مكان\', 57) (\'ركب\', 53) (\'كلام\', 49)'
},
{
  FIELD1: 28,
  Lettre: 'ر',
  Position: 1,
  BOW:
    '(\'فلان\', 631) (\'شيء\', 533) (\'به\', 217) (\'نحو\', 195) (\'جعل\', 166) (\'أرض\', 156) (\'له\', 153) (\'أمر\', 147) (\'رجل\', 141) (\'أوى\', 134) (\'ماء\', 130) (\'قوم\', 121) (\'بعض\', 120) (\'غير\', 115) (\'ضرب\', 113) (\'بين\', 105) (\'عرض\', 84) (\'مال\', 77) (\'إلي\', 76) (\'ثوب\', 73)'
},
{ FIELD1: 29, Lettre: 'ر', Position: 2, BOW: '(\'فلان\', 713) (\'شيء\', 630) (\'به\', 229) (\'نحو\', 203) (\'أمر\', 195) (\'جعل\', 173) (\'غير\', 167) (\'قوم\', 153) (\'له\', 140) (\'رجل\', 132) (\'أوى\', 118) (\'ماء\', 112) (\'بعض\', 103) (\'صار\', 98) (\'أرض\', 94) (\'كثر\', 89) (\'إلي\', 83) (\'الله\', 74) (\'ظهر\', 72) (\'مكان\', 71)' },
{
  FIELD1: 30,
  Lettre: 'ز',
  Position: 0,
  BOW:
    '(\'فلان\', 118) (\'شيء\', 111) (\'به\', 55) (\'غير\', 43) (\'زاد\', 38) (\'أوى\', 37) (\'نحو\', 36) (\'بعض\', 32) (\'جعل\', 32) (\'إلي\', 29) (\'دفع\', 29) (\'له\', 25) (\'كلام\', 24) (\'زهف\', 23) (\'حمل\', 22) (\'زور\', 22) (\'مكان\', 21) (\'ملأ\', 21) (\'زبد\', 20) (\'صار\', 19)'
},
{
  FIELD1: 31,
  Lettre: 'ز',
  Position: 1,
  BOW:
    '(\'شيء\', 209) (\'فلان\', 178) (\'به\', 64) (\'رجل\', 52) (\'نحو\', 48) (\'أمر\', 42) (\'أوى\', 41) (\'بعض\', 41) (\'قوم\', 41) (\'له\', 39) (\'صوت\', 33) (\'إلي\', 29) (\'جعل\', 28) (\'ماء\', 26) (\'أرض\', 25) (\'قطع\', 25) (\'بين\', 24) (\'غير\', 24) (\'أسرع\', 21) (\'مكان\', 21)'
},
{
  FIELD1: 32,
  Lettre: 'ز',
  Position: 2,
  BOW:
    '(\'شيء\', 132) (\'فلان\', 119) (\'به\', 52) (\'نحو\', 41) (\'رجل\', 41) (\'إلي\', 34) (\'أرض\', 29) (\'أمر\', 29) (\'ضرب\', 25) (\'قوم\', 25) (\'جاز\', 25) (\'له\', 24) (\'مال\', 23) (\'غير\', 22) (\'بعض\', 22) (\'أوى\', 21) (\'مكان\', 18) (\'قطع\', 18) (\'برز\', 16) (\'دفع\', 16)'
},
{
  FIELD1: 33,
  Lettre: 'س',
  Position: 0,
  BOW:
    '(\'فلان\', 348) (\'شيء\', 247) (\'نحو\', 138) (\'جعل\', 111) (\'له\', 99) (\'غير\', 94) (\'أوى\', 90) (\'به\', 73) (\'ماء\', 68) (\'إلي\', 68) (\'أرض\', 65) (\'قوم\', 58) (\'سم\', 49) (\'سن\', 48) (\'أمر\', 46) (\'وجه\', 42) (\'الله\', 41) (\'سهل\', 41) (\'كذ\', 40) (\'كلام\', 37)'
},
{
  FIELD1: 34,
  Lettre: 'س',
  Position: 1,
  BOW:
    '(\'شيء\', 261) (\'فلان\', 249) (\'نحو\', 56) (\'قوم\', 56) (\'به\', 55) (\'أمر\', 52) (\'جعل\', 51) (\'رجل\', 50) (\'أوى\', 50) (\'له\', 45) (\'ماء\', 45) (\'غير\', 42) (\'مس\', 39) (\'الله\', 38) (\'أرض\', 38) (\'أخذ\', 35) (\'مسح\', 33) (\'يسر\', 31) (\'بين\', 30) (\'بسط\', 29)'
},
{
  FIELD1: 35,
  Lettre: 'س',
  Position: 2,
  BOW:
    '(\'فلان\', 243) (\'شيء\', 227) (\'به\', 102) (\'أرض\', 61) (\'نحو\', 57) (\'ماء\', 56) (\'رجل\', 55) (\'قوم\', 52) (\'أمر\', 42) (\'بعض\', 42) (\'غير\', 41) (\'أوى\', 39) (\'نفس\', 37) (\'جعل\', 35) (\'له\', 34) (\'ذهب\', 31) (\'اشتد\', 29) (\'درس\', 28) (\'رأس\', 28) (\'شديد\', 27)'
},
{
  FIELD1: 36,
  Lettre: 'ش',
  Position: 0,
  BOW:
    '(\'فلان\', 199) (\'شيء\', 174) (\'نحو\', 90) (\'به\', 84) (\'أمر\', 72) (\'بعض\', 65) (\'شعر\', 54) (\'غير\', 53) (\'قوم\', 51) (\'إلي\', 48) (\'أوى\', 45) (\'جعل\', 44) (\'له\', 42) (\'رجل\', 38) (\'اشتد\', 37) (\'شر\', 36) (\'ماء\', 30) (\'أصاب\', 30) (\'شجر\', 29) (\'شق\', 28)'
},
{
  FIELD1: 37,
  Lettre: 'ش',
  Position: 1,
  BOW:
    '(\'فلان\', 218) (\'شيء\', 164) (\'نحو\', 68) (\'به\', 64) (\'قوم\', 51) (\'أمر\', 39) (\'ماء\', 38) (\'رجل\', 36) (\'أرض\', 33) (\'ثوب\', 33) (\'جعل\', 32) (\'غير\', 31) (\'له\', 27) (\'يبس\', 27) (\'أوى\', 27) (\'بشر\', 25) (\'خشن\', 25) (\'كشف\', 24) (\'بشع\', 23) (\'خش\', 23)'
},
{
  FIELD1: 38,
  Lettre: 'ش',
  Position: 2,
  BOW:
    '(\'فلان\', 181) (\'شيء\', 124) (\'نحو\', 53) (\'قوم\', 50) (\'جمع\', 46) (\'بعض\', 43) (\'به\', 35) (\'أوى\', 34) (\'رش\', 28) (\'رجل\', 28) (\'له\', 26) (\'أرض\', 26) (\'أمر\', 25) (\'حمش\', 23) (\'ماء\', 22) (\'كل\', 21) (\'غير\', 21) (\'استخرج\', 20) (\'بعد\', 20) (\'أخذ\', 19)'
},
{
  FIELD1: 39,
  Lettre: 'ص',
  Position: 0,
  BOW:
    '(\'فلان\', 143) (\'نحو\', 104) (\'شيء\', 89) (\'قوم\', 47) (\'به\', 44) (\'صوت\', 42) (\'جعل\', 39) (\'أمر\', 38) (\'له\', 36) (\'أوى\', 33) (\'صلى\', 32) (\'صرف\', 30) (\'اشتد\', 29) (\'نار\', 29) (\'ماء\', 28) (\'كان\', 28) (\'أصاب\', 27) (\'مال\', 27) (\'صار\', 26) (\'صف\', 26)'
},
{
  FIELD1: 40,
  Lettre: 'ص',
  Position: 1,
  BOW:
    '(\'شيء\', 232) (\'فلان\', 145) (\'به\', 77) (\'بعض\', 53) (\'له\', 47) (\'نحو\', 46) (\'نصف\', 42) (\'قوم\', 40) (\'أمر\', 39) (\'إلي\', 35) (\'أوى\', 34) (\'قصر\', 34) (\'جعل\', 33) (\'صار\', 31) (\'غير\', 31) (\'بلغ\', 27) (\'عصب\', 26) (\'رجل\', 24) (\'حصل\', 23) (\'نصب\', 23)'
},
{
  FIELD1: 41,
  Lettre: 'ص',
  Position: 2,
  BOW:
    '(\'شيء\', 140) (\'فلان\', 114) (\'عين\', 41) (\'به\', 39) (\'رجل\', 29) (\'أوى\', 28) (\'نحو\', 28) (\'أمر\', 28) (\'خوص\', 23) (\'أخذ\', 21) (\'غير\', 21) (\'قص\', 21) (\'شعر\', 19) (\'جعل\', 19) (\'بعض\', 18) (\'حص\', 18) (\'قرص\', 18) (\'لحم\', 16) (\'أرض\', 16) (\'رأس\', 16)'
},
{
  FIELD1: 42,
  Lettre: 'ض',
  Position: 0,
  BOW:
    '(\'نحو\', 107) (\'شيء\', 106) (\'فلان\', 96) (\'ضرب\', 82) (\'أوى\', 62) (\'به\', 61) (\'غير\', 49) (\'جعل\', 46) (\'بعض\', 41) (\'إلي\', 34) (\'مال\', 33) (\'له\', 30) (\'أمر\', 28) (\'ضر\', 26) (\'ضب\', 24) (\'ضعف\', 23) (\'ضحى\', 22) (\'ضاق\', 21) (\'ضلع\', 21) (\'اشتد\', 20)'
},
{
  FIELD1: 43,
  Lettre: 'ض',
  Position: 1,
  BOW:
    '(\'شيء\', 150) (\'فلان\', 112) (\'وضع\', 51) (\'أمر\', 41) (\'رجل\', 32) (\'به\', 30) (\'جعل\', 29) (\'له\', 29) (\'كسر\', 29) (\'قطع\', 28) (\'أرض\', 27) (\'نحو\', 27) (\'قوم\', 26) (\'غير\', 25) (\'بعض\', 25) (\'أوى\', 24) (\'قضى\', 23) (\'ماء\', 22) (\'كل\', 20) (\'حضر\', 19)'
},
{
  FIELD1: 44,
  Lettre: 'ض',
  Position: 2,
  BOW:
    '(\'شيء\', 147) (\'فلان\', 143) (\'عرض\', 62) (\'أرض\', 55) (\'ماء\', 43) (\'له\', 40) (\'به\', 38) (\'قوم\', 33) (\'قبض\', 30) (\'مكان\', 29) (\'أمر\', 28) (\'جعل\', 26) (\'نحو\', 25) (\'غرض\', 25) (\'كثر\', 24) (\'رجل\', 24) (\'غمض\', 20) (\'حرك\', 19) (\'عارض\', 19) (\'تحرك\', 19)'
},
{
  FIELD1: 45,
  Lettre: 'ط',
  Position: 0,
  BOW:
    '(\'شيء\', 163) (\'نحو\', 151) (\'فلان\', 101) (\'به\', 68) (\'جعل\', 67) (\'غير\', 66) (\'له\', 65) (\'أوى\', 55) (\'طلع\', 33) (\'طاف\', 33) (\'طف\', 31)(\'كذ\', 30) (\'بعض\', 29) (\'طلب\', 29) (\'طرف\', 25) (\'دار\', 25) (\'إلي\', 24) (\'طبع\', 23) (\'أمر\', 23) (\'طعم\', 23)'
},
{
  FIELD1: 46,
  Lettre: 'ط',
  Position: 1,
  BOW:
    '(\'شيء\', 149) (\'فلان\', 147) (\'به\', 60) (\'قطع\', 53) (\'قطر\', 50) (\'جعل\', 46) (\'رجل\', 43) (\'بعض\', 41) (\'أمر\', 41) (\'أرض\', 40) (\'له\', 39) (\'ماء\', 36) (\'قوم\', 35) (\'رطب\', 31) (\'ضرب\', 30) (\'غير\', 30) (\'أوى\', 29) (\'نحو\', 29) (\'مطر\', 27) (\'حطب\', 26)'
},
{
  FIELD1: 47,
  Lettre: 'ط',
  Position: 2,
  BOW:
    '(\'فلان\', 162) (\'شيء\', 158) (\'به\', 69) (\'غير\', 55) (\'أوى\', 51) (\'أمر\', 48) (\'نحو\', 43) (\'أرض\', 40) (\'ماء\', 29) (\'جعل\', 29) (\'شعر\', 29) (\'له\', 28) (\'سقط\', 28) (\'قوم\', 27) (\'رجل\', 27) (\'عمل\', 24) (\'خط\', 24) (\'خرط\', 23) (\'ضرب\', 22) (\'حط\', 22)'
},
{
  FIELD1: 48,
  Lettre: 'ظ',
  Position: 0,
  BOW:
    '(\'فلان\', 65) (\'شيء\', 34) (\'ظهر\', 28) (\'ظفر\', 24) (\'ظلم\', 19) (\'نحو\', 16) (\'ترب\', 12) (\'تراب\', 12) (\'تلع\', 12) (\'ظل\', 12) (\'أظل\', 12) (\'غير\', 11) (\'رأس\', 11) (\'به\', 10) (\'رجل\', 10) (\'تل\', 10) (\'ظأر\', 10) (\'ولد\', 10) (\'عطف\', 10) (\'كذ\', 10)'
},
{
  FIELD1: 49,
  Lettre: 'ظ',
  Position: 1,
  BOW:
    '(\'شيء\', 26) (\'فلان\', 24) (\'نظر\', 18) (\'أمر\', 16) (\'وظف\', 10) (\'حت\', 9) (\'حظ\', 9) (\'حظل\', 9) (\'نحو\', 8) (\'لظ\', 8) (\'لزم\', 8) (\'له\', 8) (\'بعض\', 8) (\'اشتد\', 7) (\'فت\', 7) (\'كت\', 7) (\'شجر\', 6) (\'تحات\', 6) (\'قوم\', 6) (\'جعل\', 6)'
},
{
  FIELD1: 50,
  Lettre: 'ظ',
  Position: 2,
  BOW:
    '(\'شيء\', 35) (\'فلان\', 34) (\'اشتد\', 16) (\'حفظ\', 14) (\'غلظ\', 14) (\'نحو\', 12) (\'به\', 10) (\'رجل\', 9) (\'حظ\', 9) (\'قرظ\', 9) (\'نكت\', 9) (\'غير\', 8) (\'دأظ\', 8) (\'رعظ\', 8) (\'أمر\', 8) (\'لظ\', 8) (\'انتبه\', 8) (\'تحفظ\', 7) (\'غضب\', 7) (\'كذ\', 7)'
},
{
  FIELD1: 51,
  Lettre: 'ع',
  Position: 0,
  BOW:
    '(\'فلان\', 537) (\'شيء\', 375) (\'به\', 180) (\'أمر\', 159) (\'رجل\', 131) (\'جعل\', 112) (\'قوم\', 89) (\'غير\', 86) (\'له\', 83) (\'نحو\', 81) (\'عرض\', 70) (\'أوى\', 65) (\'بعض\', 63) (\'اشتد\', 61) (\'إلي\', 61) (\'المرأة\', 55) (\'صار\', 53) (\'مال\', 52) (\'بعد\', 52) (\'ماء\', 49)'
},
{
  FIELD1: 52,
  Lettre: 'ع',
  Position: 1,
  BOW:
    '(\'فلان\', 213) (\'شيء\', 131) (\'به\', 66) (\'جعل\', 60) (\'نحو\', 53) (\'أمر\', 52) (\'شعر\', 47) (\'له\', 46) (\'غير\', 42) (\'قوم\', 40) (\'أوى\', 36) (\'دع\', 33) (\'بعض\', 32) (\'رجل\', 31) (\'طعن\', 30) (\'اشتد\', 28) (\'كل\', 27) (\'طعم\', 26) (\'أرض\', 25) (\'ماء\', 24)'
},
{
  FIELD1: 53,
  Lettre: 'ع',
  Position: 2,
  BOW:
    '(\'فلان\', 467) (\'شيء\', 347) (\'نحو\', 156) (\'به\', 141) (\'له\', 109) (\'أوى\', 105) (\'بعض\', 105) (\'قوم\', 104) (\'أمر\', 101) (\'رجل\', 99) (\'غير\', 82) (\'ماء\', 78) (\'قطع\', 73) (\'أرض\', 71) (\'رأس\', 69) (\'رفع\', 69) (\'جعل\', 64) (\'ضرب\', 60) (\'إلي\', 59) (\'وضع\', 56)'
},
{
  FIELD1: 54,
  Lettre: 'غ',
  Position: 0,
  BOW:
    '(\'فلان\', 196) (\'شيء\', 168) (\'ماء\', 70) (\'به\', 60) (\'رجل\', 54) (\'قوم\', 48) (\'كثر\', 45) (\'غير\', 44) (\'غط\', 43) (\'جعل\', 35) (\'أرض\', 35) (\'بعض\', 34) (\'نحو\', 34) (\'ليل\', 33) (\'عين\', 32) (\'غار\', 30) (\'له\', 29) (\'هو\', 28) (\'أخذ\', 27) (\'الله\', 26)'
},
{
  FIELD1: 55,
  Lettre: 'غ',
  Position: 1,
  BOW:
    '(\'فلان\', 128) (\'شيء\', 64) (\'قوم\', 40) (\'به\', 32) (\'نحو\', 28) (\'رغب\', 26) (\'غير\', 23) (\'مال\', 23) (\'ماء\', 22) (\'دغم\', 22) (\'له\', 20) (\'جعل\', 19) (\'أوى\', 19) (\'رجل\', 18) (\'صوت\', 16) (\'كلام\', 16) (\'بالغ\', 15) (\'صب\', 14) (\'بعض\', 14) (\'كثر\', 14)'
},
{
  FIELD1: 56,
  Lettre: 'غ',
  Position: 2,
  BOW:
    '(\'فلان\', 75) (\'شيء\', 48) (\'به\', 24) (\'بلغ\', 18) (\'وتغ\', 15) (\'نحو\', 14) (\'ماء\', 14) (\'زاغ\', 14) (\'ساغ\', 13) (\'طعام\', 12) (\'فرغ\', 12) (\'دفع\', 12) (\'صبغ\', 11) (\'تمرغ\', 11) (\'جعل\', 11) (\'كلام\', 10) (\'رسغ\', 10) (\'راغ\', 10) (\'دم\', 9) (\'أمر\', 9)'
},
{
  FIELD1: 57,
  Lettre: 'ف',
  Position: 0,
  BOW:
    '(\'شيء\', 221) (\'فلان\', 185) (\'أمر\', 123) (\'رجل\', 87) (\'نحو\', 74) (\'قوم\', 71) (\'به\', 69) (\'بين\', 63) (\'له\', 56) (\'جعل\', 45) (\'شق\', 45) (\'رأي\', 38) (\'غير\', 36) (\'كسر\', 32) (\'مال\', 31) (\'مبالغة\', 30) (\'ماء\', 30) (\'أرض\', 28) (\'بعض\', 28) (\'أوى\', 28)'
},
{
  FIELD1: 58,
  Lettre: 'ف',
  Position: 1,
  BOW:
    '(\'فلان\', 340) (\'شيء\', 318) (\'به\', 133) (\'نحو\', 114) (\'له\', 86) (\'قوم\', 85) (\'أوى\', 68) (\'رجل\', 64) (\'غير\', 63) (\'جعل\', 59) (\'أمر\', 54) (\'بعض\', 52) (\'رفع\', 47) (\'ضرب\', 46) (\'مال\', 43) (\'ثوب\', 42) (\'نفس\', 41) (\'ماء\', 40) (\'أسرع\', 39) (\'خف\', 39)'
},
{
  FIELD1: 59,
  Lettre: 'ف',
  Position: 2,
  BOW:
    '(\'شيء\', 386) (\'فلان\', 329) (\'به\', 152) (\'له\', 105) (\'جعل\', 103) (\'نحو\', 88) (\'غير\', 73) (\'أمر\', 72) (\'قوم\', 71) (\'أوى\', 70) (\'رجل\', 68) (\'بعض\', 63) (\'إلي\', 63) (\'مال\', 58) (\'أرض\', 53) (\'أخذ\', 49) (\'خلف\', 47) (\'ماء\', 43) (\'أسرع\', 43) (\'ضرب\', 42)'
},
{
  FIELD1: 60,
  Lettre: 'ق',
  Position: 0,
  BOW:
    '(\'فلان\', 397) (\'شيء\', 346) (\'به\', 119) (\'رجل\', 111) (\'أمر\', 97) (\'قوم\', 93) (\'غير\', 87) (\'نحو\', 82) (\'له\', 80) (\'قطع\', 76) (\'جعل\', 73) (\'أوى\', 62) (\'ماء\', 60) (\'جمع\', 59) (\'بين\', 57) (\'أخذ\', 55) (\'قدر\', 54) (\'بعض\', 52) (\'صار\', 50) (\'أرض\', 46)'
},
{
  FIELD1: 61,
  Lettre: 'ق',
  Position: 1,
  BOW:
    '(\'فلان\', 268) (\'شيء\', 245) (\'نحو\', 88) (\'أوى\', 63) (\'رجل\', 60) (\'به\', 59) (\'أمر\', 59) (\'جعل\', 52) (\'ماء\', 51) (\'له\', 51) (\'أرض\', 42) (\'غير\', 41) (\'قع\', 37) (\'وقف\', 37) (\'كلام\', 34) (\'بين\', 33) (\'ضرب\', 32) (\'أخذ\', 31) (\'صار\', 31) (\'صوت\', 31)'
},
{
  FIELD1: 62,
  Lettre: 'ق',
  Position: 2,
  BOW:
    '(\'شيء\', 308) (\'فلان\', 304) (\'به\', 130) (\'نحو\', 117) (\'ماء\', 81) (\'غير\', 66) (\'جعل\', 65) (\'أوى\', 65) (\'أمر\', 64) (\'بعض\', 60) (\'له\', 56) (\'قوم\', 55) (\'رجل\', 54) (\'إلي\', 54) (\'بين\', 52) (\'ثوب\', 50) (\'حلق\', 50) (\'علق\', 47) (\'أرض\', 46) (\'رق\', 45)'
},
{
  FIELD1: 63,
  Lettre: 'ك',
  Position: 0,
  BOW:
    '(\'فلان\', 241) (\'شيء\', 231) (\'رجل\', 105) (\'أمر\', 63) (\'به\', 58) (\'أوى\', 56) (\'جعل\', 55) (\'غير\', 47) (\'قوم\', 44) (\'بعض\', 41) (\'كل\', 38) (\'له\', 38) (\'وجه\', 36) (\'نفس\', 33) (\'مال\', 31) (\'أرض\', 31) (\'كذب\', 30) (\'رأس\', 27) (\'إلي\', 26) (\'ثوب\', 26)'
},
{
  FIELD1: 64,
  Lettre: 'ك',
  Position: 1,
  BOW:
    '(\'فلان\', 237) (\'شيء\', 169) (\'أمر\', 109) (\'نحو\', 71) (\'بعض\', 63) (\'به\', 60) (\'رجل\', 45) (\'أوى\', 44) (\'جعل\', 40) (\'ذكر\', 40) (\'اشتد\', 36) (\'ركب\', 36) (\'غير\', 34) (\'كل\', 32) (\'إلي\', 32) (\'قوم\', 29) (\'دابة\', 29) (\'ضرب\', 28) (\'أرض\', 26) (\'شد\', 26)'
},
{
  FIELD1: 65,
  Lettre: 'ك',
  Position: 2,
  BOW:
    '(\'فلان\', 135) (\'شيء\', 127) (\'أمر\', 54) (\'به\', 41) (\'نحو\', 36) (\'جعل\', 35) (\'ورك\', 34) (\'بعض\', 34) (\'رجل\', 30) (\'مكان\', 24) (\'أرض\', 24) (\'فك\', 21) (\'قوم\', 20) (\'دابة\', 20) (\'حك\', 20) (\'اشتد\', 19) (\'أوى\', 19) (\'شك\', 19) (\'حر\', 18) (\'ثوب\', 17)'
},
{
  FIELD1: 66,
  Lettre: 'ل',
  Position: 0,
  BOW:
    '(\'فلان\', 357) (\'شيء\', 319) (\'به\', 219) (\'بعض\', 88) (\'أمر\', 75) (\'ضرب\', 71) (\'غير\', 61) (\'إلي\', 55) (\'قوم\', 54) (\'رجل\', 53) (\'أوى\', 53) (\'كل\', 45) (\'جعل\', 45) (\'لزم\', 43) (\'نحو\', 41) (\'لحم\', 39) (\'كلام\', 39) (\'أرض\', 38) (\'هو\', 36) (\'بين\', 36)'
},
{
  FIELD1: 67,
  Lettre: 'ل',
  Position: 1,
  BOW:
    '(\'شيء\', 528) (\'فلان\', 517) (\'نحو\', 172) (\'به\', 166) (\'جعل\', 130) (\'أمر\', 126) (\'أوى\', 122) (\'قوم\', 105) (\'له\', 102) (\'غير\', 100) (\'رجل\', 93) (\'إلي\', 75) (\'مكان\', 64) (\'ماء\', 62) (\'جلد\', 58) (\'ذهب\', 57) (\'أرض\', 54) (\'صار\', 52) (\'اشتد\', 52) (\'رأس\', 52)'
},
{
  FIELD1: 68,
  Lettre: 'ل',
  Position: 2,
  BOW:
    '(\'فلان\', 588) (\'شيء\', 482) (\'رجل\', 166) (\'به\', 158) (\'جعل\', 148) (\'نحو\', 141) (\'غير\', 137) (\'أمر\', 121) (\'قوم\', 116) (\'أوى\', 113) (\'له\', 109) (\'بعض\', 87) (\'إلي\', 85) (\'ماء\', 83) (\'مال\', 77) (\'مكان\', 70) (\'عمل\', 66) (\'كل\', 63) (\'حمل\', 62) (\'المرأة\', 61)'
},
{
  FIELD1: 69,
  Lettre: 'م',
  Position: 0,
  BOW:
    '(\'فلان\', 353) (\'شيء\', 348) (\'به\', 120) (\'ماء\', 109) (\'رجل\', 75) (\'نحو\', 73) (\'أمر\', 70) (\'أوى\', 63) (\'له\', 63) (\'قوم\', 59) (\'أرض\', 55) (\'ذهب\', 52) (\'جعل\', 49) (\'مد\', 49) (\'يد\', 49) (\'غير\', 47) (\'مسح\', 44) (\'مال\', 42) (\'الله\', 40) (\'ملح\', 39)'
},
{
  FIELD1: 70,
  Lettre: 'م',
  Position: 1,
  BOW:
    '(\'فلان\', 435) (\'شيء\', 323) (\'نحو\', 180) (\'غير\', 116) (\'به\', 113) (\'أمر\', 106) (\'أوى\', 101) (\'جعل\', 98) (\'رجل\', 92) (\'قوم\', 84) (\'بعض\', 81) (\'ماء\', 79) (\'له\', 70) (\'أرض\', 63) (\'كثر\', 57) (\'اشتد\', 56) (\'صار\', 56) (\'إلي\', 55) (\'عين\', 53) (\'المرأة\', 52)'
},
{
  FIELD1: 71,
  Lettre: 'م',
  Position: 2,
  BOW:
    '(\'فلان\', 504) (\'شيء\', 434) (\'أمر\', 152) (\'به\', 122) (\'نحو\', 121) (\'أوى\', 118) (\'غير\', 115) (\'جعل\', 109) (\'قوم\', 98) (\'رجل\', 95) (\'له\', 91) (\'بعض\', 90) (\'كل\', 69) (\'قطع\', 60) (\'لحم\', 56) (\'عظم\', 55) (\'صار\', 54) (\'أرض\', 53) (\'اشتد\', 52) (\'نفس\', 52)'
},
{
  FIELD1: 72,
  Lettre: 'ن',
  Position: 0,
  BOW:
    '(\'شيء\', 609) (\'فلان\', 546) (\'نحو\', 143) (\'به\', 139) (\'قوم\', 112) (\'أمر\', 111) (\'بعض\', 102) (\'له\', 98) (\'ماء\', 98) (\'أوى\', 95) (\'أرض\', 79) (\'صوت\', 64) (\'جعل\', 64) (\'استخرج\', 59) (\'إلي\', 57) (\'دابة\', 55) (\'طلب\', 55) (\'بعد\', 54) (\'غير\', 53) (\'رجل\', 51)'
},
{
  FIELD1: 73,
  Lettre: 'ن',
  Position: 1,
  BOW:
    '(\'فلان\', 261) (\'شيء\', 189) (\'به\', 100) (\'نحو\', 77) (\'أمر\', 74) (\'مال\', 73) (\'له\', 72) (\'رجل\', 70) (\'إلي\', 64) (\'جعل\', 62) (\'سن\', 50) (\'أوى\', 47) (\'غير\', 44) (\'صوت\', 43) (\'جنب\', 41) (\'المرأة\', 35) (\'بعض\', 34) (\'صار\', 33) (\'أنف\', 31) (\'بعير\', 31)'
},
{
  FIELD1: 74,
  Lettre: 'ن',
  Position: 2,
  BOW:
    '(\'فلان\', 319) (\'شيء\', 292) (\'به\', 121) (\'له\', 85) (\'أوى\', 80) (\'أمر\', 77) (\'جعل\', 75) (\'نحو\', 70) (\'رجل\', 68) (\'صار\', 48) (\'ماء\', 48) (\'مكان\', 45) (\'سمن\', 43) (\'قوم\', 41) (\'غير\', 40) (\'بعض\', 38) (\'ثوب\', 37) (\'سن\', 37) (\'صوت\', 36) (\'كثر\', 35)'
},
{ FIELD1: 75, Lettre: 'هـ', Position: 0, BOW: "('فلان', 385) ('شيء', 187) ('نحو', 82) ('رجل', 75) ('قوم', 64) ('به', 58) ('أمر', 55) ('صوت', 48) ('غير', 41) ('له', 40) ('بعض', 39) ('كسر', 38) ('أرض', 34) ('أسرع', 34) ('أوى', 29) ('مبالغة', 28) ('جعل', 27) ('ماء', 27) ('اشتد', 26) ('إبل', 25)" },
{ FIELD1: 76, Lettre: 'هـ', Position: 1, BOW: "('فلان', 261) ('شيء', 239) ('به', 90) ('له', 64) ('أمر', 63) ('أوى', 56) ('إلي', 51) ('غير', 48) ('جهد', 46) ('قوم', 43) ('رجل', 42) ('نحو', 38) ('ظهر', 34) ('جعل', 34) ('ذهب', 33) ('بعض', 32) ('جهر', 31) ('أخذ', 30) ('هم', 30) ('صار', 29)" },
{ FIELD1: 77, Lettre: 'هـ', Position: 2, BOW: "('فلان', 88) ('شيء', 53) ('سفه', 31) ('وجه', 31) ('به', 29) ('له', 27) ('رجل', 23) ('أمر', 22) ('عقل', 20) ('نفس', 20) ('ذهب', 20) ('وله', 19) ('أوى', 19) ('نحو', 19) ('ماء', 19) ('أصاب', 18) ('إلي', 16) ('اشتد', 16) ('جعل', 15) ('غير', 15)" },
{
  FIELD1: 78,
  Lettre: 'و',
  Position: 0,
  BOW:
    '(\'فلان\', 706) (\'شيء\', 410) (\'أمر\', 148) (\'به\', 140) (\'جعل\', 105) (\'له\', 103) (\'إلي\', 103) (\'قوم\', 91) (\'أرض\', 77) (\'رجل\', 74) (\'أوى\', 72) (\'بعض\', 69) (\'وضع\', 68) (\'الله\', 66) (\'نحو\', 59) (\'ضرب\', 58) (\'غير\', 53) (\'كثر\', 50) (\'مكان\', 46) (\'ماء\', 43)'
},
{
  FIELD1: 79,
  Lettre: 'و',
  Position: 1,
  BOW:
    '(\'فلان\', 655) (\'شيء\', 542) (\'به\', 258) (\'أمر\', 169) (\'نحو\', 147) (\'جعل\', 134) (\'غير\', 132) (\'أوى\', 131) (\'إلي\', 120) (\'قوم\', 120) (\'رجل\', 118) (\'ماء\', 111) (\'له\', 109) (\'بعض\', 105) (\'مال\', 97) (\'دار\', 86) (\'مكان\', 78) (\'طلب\', 72) (\'أرض\', 70) (\'أصاب\', 67)'
},
{
  FIELD1: 80,
  Lettre: 'و',
  Position: 2,
  BOW:
    '(\'فلان\', 443) (\'شيء\', 355) (\'به\', 160) (\'نحو\', 118) (\'جعل\', 86) (\'له\', 84) (\'قوم\', 83) (\'أوى\', 70) (\'إلي\', 67) (\'أمر\', 67) (\'غير\', 56) (\'رجل\', 47) (\'أرض\', 47) (\'نار\', 42) (\'صار\', 41) (\'بعض\', 41) (\'مال\', 40) (\'طلب\', 37) (\'ارتفع\', 37) (\'كثر\', 35)'
},
{
  FIELD1: 81,
  Lettre: 'ي',
  Position: 0,
  BOW:
    '(\'فلان\', 36) (\'يسر\', 30) (\'شيء\', 25) (\'يد\', 23) (\'نحو\', 14) (\'يمن\', 14) (\'أوى\', 13) (\'يمين\', 13) (\'أخذ\', 11) (\'تحقق\', 9) (\'يبس\', 8) (\'سهل\', 8) (\'تيسر\', 8) (\'انتبه\', 8) (\'علم\', 8) (\'أيبس\', 7) (\'قوم\', 7) (\'يتم\', 7) (\'ولد\', 7) (\'بلوغ\', 7)'
},
{
  FIELD1: 82,
  Lettre: 'ي',
  Position: 1,
  BOW:
    '(\'فلان\', 369) (\'شيء\', 270) (\'به\', 119) (\'قوم\', 90) (\'نحو\', 88) (\'جعل\', 84) (\'غير\', 80) (\'له\', 72) (\'أمر\', 68) (\'رجل\', 60) (\'ماء\', 58) (\'أوى\', 58) (\'مال\', 55) (\'أرض\', 53) (\'صار\', 52) (\'بعض\', 50) (\'إلي\', 46) (\'كذ\', 41) (\'المرأة\', 37) (\'الله\', 36)'
},
{
  FIELD1: 83,
  Lettre: 'ي',
  Position: 2,
  BOW:
    '(\'فلان\', 501) (\'شيء\', 310) (\'أمر\', 136) (\'له\', 127) (\'به\', 125) (\'إلي\', 104) (\'نحو\', 88) (\'رجل\', 84) (\'جعل\', 82) (\'بعض\', 72) (\'قوم\', 71) (\'غير\', 64) (\'أوى\', 53) (\'الله\', 53) (\'ماء\', 48) (\'أرض\', 47) (\'طلب\', 46) (\'مال\', 43) (\'مكان\', 38) (\'كذ\', 37)'
}]
const OPTIONS_LIMIT = 20;
const defaultFilterOptions = createFilterOptions();

const filterOptions = (options, state) => {
  return defaultFilterOptions(options, state).slice(0, OPTIONS_LIMIT);
};

const letters_positions = ['ء', 'ب', 'ت', 'ث', 'ج', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ك', 'ل', 'م', 'ن', 'هـ', 'و', 'ي']
const font_size = {
  fontSize: 25,
}
function Guess() {
  const [main_root, useroot] = useState('');
  const [word, useword] = useState('آب');
  const [calculated_root, usecalculated] = useState('');
  const [bow_value, usebow] = useState('');
  const [letters, useletters] = useState([]);
  const [dictionnary, usedictionary] = useState('');
  const handleChange_dictionary = (event) => {
    usedictionary(event.target.value);
    console.log(event.target.value)
  }
  useEffect(() => {
    var index = 0
    var limit = guess.length
    for (var i = 0; i < limit; i++) {
      if (guess[i].Word === word) {
        index = i
        break
      }
    }

    // console.log(localization[index].Word)
    useroot(guess[index].Root)
    usecalculated(guess[index].Predicted_root)
    usebow(guess[index].BOW)
   
  }, [word]);

  return (
    <div>
        <FormControl variant="filled" sx={{ m: 1, minWidth: 200 }} style={{marginLeft:'2%'}}>
        <InputLabel id="demo-simple-select-filled-label">Choose Dictionary</InputLabel>
        <Select
          labelId="demo-simple-select-filled-label"
          id="demo-simple-select-filled"
          value={dictionnary}
          onChange={handleChange_dictionary}
        >
          <MenuItem value="Wassit">
            <em>Wassit</em>
          </MenuItem>
          <MenuItem value="Moassir">
            <em>Moassir</em>
          </MenuItem>
        </Select>
      </FormControl>
      <div style={{ display: 'flex', marginTop: '5%', marginBottom: '5%' }}>
        <Autocomplete
          dir="rtl"
          filterOptions={filterOptions}
          onChange={(event,value) => {useword(value.label)}} 
          disablePortal
          id="combo-box-demo"
          options={words}
          sx={{ width: 300 }}
          renderInput={(params) => <TextField {...params} label="Choose Word" />}
         
        />


      </div>

      <TableContainer component={Paper}>
        <Table aria-label="caption table">
          <TableHead>
            <TableRow>
              <TableCell>Word</TableCell>
              <TableCell>{dictionnary} Root</TableCell>
              <TableCell>Definition</TableCell>
              <TableCell>Calculated Root</TableCell>
            </TableRow>
          </TableHead>
          <TableBody>
            <TableRow key="only_one">
              <TableCell style={font_size}>
                {word}
              </TableCell>
              <TableCell style={font_size}>
                {main_root}
              </TableCell>
              <TableCell style={font_size}>
                {bow_value}
              </TableCell>
              <TableCell style={font_size}>
                {calculated_root}
              </TableCell>
            </TableRow>

          </TableBody>
        </Table>
      </TableContainer>
      <Button variant="contained" onClick={() => {
          // first we take the root value and we split it 
          var root = calculated_root.split("")
          // find the position of every element in the root array
          useletters(root)

        }} style={{ marginRight: '5%' ,marginTop:'5%',backgroundColor:"#2f4f4f"}}>Show BOW</Button>
      <TableContainer component={Paper} style={{ marginTop: '5%' }}>
        <Table aria-label="caption table">
          <TableHead>
            <TableRow>
              <TableCell>Letter</TableCell>
              <TableCell>Bow</TableCell>
            </TableRow>
          </TableHead>
          <TableBody>
            {letters.map((value, index) => {
    
              return (
                <TableRow>
                  <TableCell style={{ marginLeft: '5%',fontSize: 25}}>{value}</TableCell>
                  <TableCell style={{ marginLeft: '5%', fontSize: 25}}>{bow[letters_positions.indexOf(value) * 3 + index].BOW}</TableCell>
                </TableRow>

              )
            })}
          </TableBody>
        </Table>
      </TableContainer>
    </div>

  );
}

export default Guess;
